app/views/users/edit.html.erb

     </div>
    <% @user.posts.each do |post|%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]