app/controllers/likes_controller.rb

    def create
        @like = Like.new(
            user_id: @current_user.id,
            post_id: params[:post_id]
            )

        @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["post_id", 7], ["created_at", "2019-10-19 12:51:31.123111"], ["updated_at", "2019-10-19 12:51:31.123111"]]

    def destroy
        @like = Like.find_by(
            user_id: @current_user.id,
            post_id: params[:post_id]
            )

        @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 3], ["post_id", 7], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]