app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc)
    @posts = Post.page(params[:page]).per(8)
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create
    @post = Post.find_by(id: params[:id])
    @post = Post.new(
    content: params[:content],
    detail: params[:detail],
    user_id: @current_user.id,
    image_name: "default_image.jpg")

   if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("content", "image_name", "detail", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "猫の里親募集3"], ["image_name", "default_image.jpg"], ["detail", "JJJJ"], ["user_id", 3], ["created_at", "2019-10-18 12:30:11.758530"], ["updated_at", "2019-10-18 12:30:11.758530"]]

  def show
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)
    @like_count = Like.where(post_id: @post.id).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    @post.detail = params[:detail]

    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ssssssssssええええええええええええ"], ["updated_at", "2019-10-19 14:46:21.065064"], ["id", 13]]