app/controllers/users_controller.rb

  def index
    @users = User.all.order(created_at: :asc)
    @users = User.page(params[:page]).per(8)
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]