app/controllers/users_controller.rb

  def index

    if params[:q] && params[:q].reject { |key, value| value.blank? }.present?
      @q = User.ransack(search_params, activated_true: true)
    else
      @q = User.ransack(activated_true: true)
    end
      @users = @q.result.page(params[:page]).per(8)
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? ORDER BY "users"."created_at" DESC LIMIT ? OFFSET ?  [["activated", "t"], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]

  def create
    @user = User.find_by(id: params[:id])
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      image_name: "default_users.jpg",)

    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "image_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["image_name", "default_users.jpg"], ["created_at", "2019-10-17 12:11:25.486268"], ["updated_at", "2019-10-17 12:11:25.486268"]]

  def edit
    @user = User.find_by(id: params[:id])
    redirect_to root_url and return unless @user.activated?
    @posts = Post.where(user_id: @user.id).page(params[:page]).per(4)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]

  def login
    @user = User.find_by(email: params[:email],password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "ryusuke@gmail.com"], ["password", 0], ["LIMIT", 1]]

  def destroy
    @user = User.find_by(id: params[:id])
    @user.destroy
    @post = Post.where(user_id: @user.id)
    @post.destroy_all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 11]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    @user.password = params[:password]

    if params[:image]
     @user.image_name = "#{@user.id}.jpg"
     image = params[:image]
     File.binwrite("public/users_images/#{@user.image_name}",image.read)
    end

    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ryusukeminees"], ["image_name", "3.jpg"], ["updated_at", "2019-10-19 13:07:37.095831"], ["id", 3]]